app/Models/Comentarios.php

INSERT INTO `comentario` (`id_tema`, `descripcion_comentario`) VALUES ('12', 'l ganador del premio Turing, Jim Gray, imaginó la ciencia de datos como un \"cuarto paradigma\" de la ciencia (empírico, teórico, computacional, y ahora basado en datos), y afirmó que \"todo lo relacionado con la ciencia está cambiando debido al impacto de la tecnología de la información y el diluvio de datos\"')
SELECT *
FROM `comentario`
---
    public function ingresarComentario($id_tema,$comentario)
    {
        $comentarios= [
            "id_tema"=>$id_tema,
            "descripcion_comentario"=>$comentario
        ];

        $db      = \Config\Database::connect();
        $builder = $db->table('comentario');
        $builder->insert($comentarios);
        return $builder->get()->getResultArray();

SELECT *
FROM `comentario`
---
    public function Buscarcomentarios()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('comentario');
        $builder->select('*');
        return $builder->get()->getResult();