app/Models/LoginUser.php

SELECT `id_usuario`
FROM `usuarios`
WHERE `correo` = 'yesenia@gmail.com'
AND `pass_usuario` = 'yesenia1234'
---
    public function buscarUsuario($correo,$pass)
    {

        $db      = \Config\Database::connect();
        $builder = $db->table('usuarios');
        $builder-> select('id_usuario');
        $builder->where("correo",$correo);
        $builder->where("pass_usuario",$pass);
        return $builder->get()->getResultArray();