app/Models/Temas.php

INSERT INTO `temas` (`titulo_tema`, `descripcion_tema`, `url_tema`) VALUES ('Progresive web App', 'Una aplicación web progresiva (PWA por sus siglas en inglés) es un tipo de software de aplicación que se entrega a través de la web, creado utilizando tecnologías web comunes como HTML, CSS y JavaScript.', 'https://es.wikipedia.org/wiki/Aplicaci%C3%B3n_web_progresiva')
SELECT *
FROM `temas`
---
    public function IngresarTema($titulo, $descripcion, $url)
    {
        $tema = [
            "titulo_tema" => $titulo,
            "descripcion_tema" => $descripcion,
            "url_tema" => $url
        ];

        $db      = \Config\Database::connect();
        $builder = $db->table('temas');
        $builder->insert($tema);
        return $builder->get()->getResultArray();

SELECT *
FROM `temas`
---
    public function BuscarTemas(){
        $db      = \Config\Database::connect();
        $builder = $db->table('temas');
        $builder->select('*');
        return $builder->get()->getResult();